{
    "home": "home",
    "projects": "projectes",
    "cv": "cv",
    "contact": "contacte",
    "still thinking about that page :)": "encara m'estic pensant què posar aquí :)",
    "successful projects": "projectes exitosos",
    "what I am looking for": "el que m'agradaria",
    "I want to get a position in a former company doing web development and learn more about how the workflow in companies is. Once I achieved that, the main objective is become a good web developer, and if you ask my personal preference I will choose backend over frontend.": "M'agradaria obtenir una posició com a desenvolupador web per poder aprendre més sobre els fluxes de treball i les peculiaritats del sector. Idealment m'agradaria una posició més enfocada a resoldre problemes que al diseny d'interfícies.",
    "about me": "sobre mi",
    "When I finished high school, I started my bachelor degree in Computer Science, however I could not finish it at that time since I had to start working due to familiar reasons. I started to work as audio-visual and computer technician for <span class=\"font-italic\">Solucions d’Assessorament Gestió i Implementació Audiovisual i Informàtica de Catalunya S.L.</span> and I have been working there nonstop until 2018 (the company changed his name while I was there). In that year I felt that my career was stuck so I quit my job and I moved to Umeå (Sweden) with my girlfriend. We spent 2 years there working and studying and, at the end, I achieve my BS in Computer Science. At 2020, we moved for second time to Newcastle Upon Tyne (UK) where at the end of 2020 I finished a MS in Web Development in Universitat Oberta de Catalunya. Nowadays I am doing freelance jobs and searching for a permanent position either attended or remote.": "Quan vaig acabar l'institut, vaig començar el grau en enginyeria informàtica però ho vaig haver de deixar ja que per motius familiars em vaig haver de posar a treballar. Vaig començar com a tècnic audiovisual i informàtic per l'empresa <span class=\"font-italic\">Solucions d’Assessorament Gestió i Implementació Audiovisual i Informàtica de Catalunya S.L.</span> en la que vaig estar fins al 2018 (l'empresa va anar cambiant de nom però jo vaig seguir). Aquest any em vaig sentir estancat i vaig plegar, llavors jo i la meva companya ens vam traslladar a Umeå (Suècia) on ens hi vam estar 2 anys que vaig aprofitar per acabar el grau en enginyeria informàtica. El 2020 ens vam traslladar per segona vegada a Newcastle Upon Tyne (Regne Unit) on a finals de 2020 vaig acabar un màster en desenvolupament web. Des de llavors estic traballant com a desenvolupador web freelance mentre estic buscant feina com a desenvolupador web en alguna empresa ja sigui de manera presencial o en remote.",
    "education and training": "educació",
    "MSc in Web Development": "Màster en Desenvolupament de Llocs i Aplicacions Web",
    "in Universitat Oberta de Catalunya, finished the 7th of July 2021.": "per la Universitat Oberta de Catalunya, acabat el 7 de juliol de 2021.",
    "BS in Computer Science": "Gradu en Enginyeria Informàtica",
    "in Universitat Oberta de Catalunya, finished the 10th of January 2020.": "per la Universitat Oberta de Catalunya, acabat el 10 de gener de 2020.",
    "work experience": "experiència",
    "Freelance web developing": "Desenvolupament web freelance",
    "(1st of January 2021 – nowadays). Web development mainly in Angular and Laravel.": "(1 de gener de 2021 – actualitat). Desenvolupament web majoritariament en Angular i Laravel.",
    "Nextec Technological Projects S.L.": "Nextec Technological Projects S.L.",
    "(17th of January 2017 – 22th of December 2017). Touchscreens, audio-visual equipment and computer deployment. Network deployment and enhancements.": "(17 de gener de 2017 – 22 de decembre de 2017). Instalació de pantalles tàctils, equips audiovisuals i ordinadors. Amplicació i instal·lació de xarxes.",
    "Grup Comm Technology Tarragona Lleida S.L.": "Grup Comm Technology Tarragona Lleida S.L.",
    "(2nd of July 2010 – 16th of January 2017). Touchscreens, audio-visual equipment and computer deployment. Network deployment and enhancements.": "(2 de juliol de 2010 – 16 de gener de 2017). Instalació de pantalles tàctils, equips audiovisuals i ordinadors. Amplicació i instal·lació de xarxes.",
    "Solucions d'Assessorament Gestió i Implementació Audiovisual i Informàtica de Catalunya S.L.": "Solucions d’Assessorament Gestió i Implementació Audiovisual i Informàtica de Catalunya S.L.",
    "(11th of August 2009 – 1st of July 2010). Helpdesk to high schools.": "(11 d'agost de 2009 – 1 de juliol de 2010). Helpdesk a centros educatius.",
    "technical skills": "habilitats tècniques",
    "Web development related:": "Relacionades amb el desenvolupament web:",
    "HTML, CSS, SASS, JS, TypeScript, PHP, PHPUnit, MySQL, NPM, Git, Composer, Node.js, RxJS, Angular, Laravel, Codeigniter, Redux, Bootstrap, Angular Material, Tailwind, LAMP, PhpMyAdmin.": "HTML, CSS, SASS, JS, TypeScript, PHP, PHPUnit, MySQL, NPM, Git, Composer, Node.js, RxJS, Angular, Laravel, Codeigniter, Redux, Bootstrap, Angular Material, Tailwind, LAMP, PhpMyAdmin.",
    "Other programing languages:": "Altres llenguatges de programació:",
    "C, Java, R, Python, Bash.": "C, Java, R, Python, Bash.",
    "Development patterns:": "Patrons de diseny:",
    "TDD, OOP, MVC.": "TDD, OOP, MVC,...",
    "Other skills:": "Altres habilitats:",
    "Embedded systems, microcontrollers, networks.": "Sistemes encastats, microcontroladors, xarxes.",
    "personal skills": "habilitats personals",
    "Fast learner, logic mind, liable, teamwork, but also independent worker.": "Aprenc ràpid, ment lògica, responsable, capacitat de traball en equip però també independent.",
    "languages": "lengües",
    "English:": "Anglès",
    "Independent user (B2 CEFR & living in UK).": "Usuari independent (B2 CEFR i resident al Regne Unit)",
    "Catalan:": "Català",
    "Proficiency user (Native).": "Natiu",
    "Spanish:": "Castellà",
    "personal info": "dades personals",
    "Phone:": "Telèfon:",
    "+34 690208110 y +44 (0) 7521126691": "+34 690208110 y +44 (0) 7521126691",
    "Email:": "Correu electrònic:",
    "Current home place:": "Lloc de residència:",
    "Newcastle Upon Tyne (UK) (open to relocation)": "Newcastle Upon Tyne (Regne Unit) (obert a traslladar-me)",
    "Availability:": "Disponibilitat:",
    "Immediate ": "Immediata",
    "If you have something to tell me or just want to be in touch just fill the form and hit send...": "Si em vols dir alguna cosa o simplement estar en contacte omple el formulari següent i fes clic a enviar missatge...",
    "Name": "Nom",
    "John Smith": "Joan Ferré",
    "Email": "Correu electrònic",
    "example@gmail.com": "exemple@gmail.cat",
    "Message": "Missatge",
    "What you want to say...": "El que vulguis dir-me...",
    "send message": "enviar missatge",
    "Thank for your message! I will get back to you soon :)": "Gràcies pel teu missatge! En breu em posaré en contacte amb tu :)",
    "The :attribute field is required.": "El camp :attribute es obligatori",
    "The :attribute must be a valid email address": "El camp :attribute ha de ser una adreça de correu electrònic vàlida",
    "You need a complex web aplication? Maybe some special features that common CMS can't fulfill? A huge DB to efficiently manage? A custom API?": "Necessites una aplicació web complexa? Potser algunes característiques especials que els CMS comuns no et poden proporcionar? Una gran BD que has de gestionar? Una API personalitzada?",
    "If the response to at last one of that questions is yes, contact me. I can transform your thoughts into a modern and secure web app.": "Si la resposta a almenys una de les qüestions anteriors es sí, contacta amb mi. Puc trasnformar els teus pensaments en una aplicació web moderna i segura.",
    "If you need a comon and boring wordpress page I can do it aswell, so... CONTACT CONTACT!": "Si necessites una pàgina wordpress comuna i aborrida també puc fer-la, així que... CONTACTA CONTACTA"
}
