{
    "home": "home",
    "projects": "projectes",
    "cv": "cv",
    "contact": "contacte",
    "still thinking about that page :)": "encara m'estic pensant què posar aquí :)",
    "successful projects": "projectes exitosos",
    "what I am looking for": "el que m'agradaria",
    "I am excited by the opportunity to work permanently with an innovative company in which I can utilize my experience and my skills as a frontend and/or a backend web developer and thus contribute to the success of the company.": "M'agradaria tenir l'oportunitat de treballar permanentment amb una empresa innovadora en la qual puc utilitzar la meva experiència i les meves habilitats com a desenvolupador web ja sigui en el frontend o en el backend i contribuir així a l'èxit de l'empresa.",
    "about me": "sobre mi",
    "After 8 years working as an audio-visual and computer technician, I decided to expand my personal and professional horizons by moving to Sweden and later to the UK while finishing my BSc in Computer Science and completing my MS in Web Development in a distance-learning university. As a freelance web developer, I have successfully developed personal websites and a corporate intranet using Angular as a frontend and Laravel as a backend, which are only an example of some of the technical skills I possess. Personally, I’m a fast learner, logical minded and a responsible team player who can also work independently. I’m currently seeking a permanent position as a frontend or backend web developer in an exciting and innovative company.": "Després de 8 anys treballant com a tècnic audiovisual i informàtic, vaig decidir ampliar els meus horitzons personals i professionals mudant-me a Suècia i més tard al Regne Unit mentre acabava el Grau en Enginyeria Informàtica i el Màster en Desenvolupament Web en una universitat a distància. Com a desenvolupador web freelance, he desenvolupat amb èxit llocs web personals i una intranet corporativa utilitzant Angular com a frontend i Laravel com a backend les quals són només un exemple d'algunes de les habilitats tècniques que tinc. Personalment, aprenc ràpid, tinc una ment lògica, sóc responsable i tinc capacitat de treball en equip però també puc treballar de manera independent. Actualment estic buscant una posició permanent com a desenvolupador web frontend o backend en una empresa emocionant i innovadora.",
    "education and training": "educació",
    "MSc in Web Development": "Màster en Desenvolupament de Llocs i Aplicacions Web",
    "in Universitat Oberta de Catalunya, finished the 7th of July 2021.": "per la Universitat Oberta de Catalunya, acabat el 7 de juliol de 2021.",
    "BSc in Computer Science": "Grau en Enginyeria Informàtica",
    "in Universitat Oberta de Catalunya, finished the 10th of January 2020.": "per la Universitat Oberta de Catalunya, acabat el 10 de gener de 2020.",
    "work experience": "experiència",
    "Freelance web developing": "Desenvolupament web freelance",
    "(1st of January 2021 – current). Web development mainly in Angular and Laravel.": "(1 de gener de 2021 – actualitat). Desenvolupament web majoritariament en Angular i Laravel.",
    "Nextec Technological Projects S.L.": "Nextec Technological Projects S.L.",
    "(17th of January 2017 – 22th of December 2017). Touchscreens, audio-visual equipment and computer deployment. Network deployment and enhancements.": "(17 de gener de 2017 – 22 de decembre de 2017). Instalació de pantalles tàctils, equips audiovisuals i ordinadors. Amplicació i instal·lació de xarxes.",
    "Grup Comm Technology Tarragona Lleida S.L.": "Grup Comm Technology Tarragona Lleida S.L.",
    "(2nd of July 2010 – 16th of January 2017). Touchscreens, audio-visual equipment and computer deployment. Network deployment and enhancements.": "(2 de juliol de 2010 – 16 de gener de 2017). Instalació de pantalles tàctils, equips audiovisuals i ordinadors. Amplicació i instal·lació de xarxes.",
    "Solucions d'Assessorament Gestió i Implementació Audiovisual i Informàtica de Catalunya S.L.": "Solucions d’Assessorament Gestió i Implementació Audiovisual i Informàtica de Catalunya S.L.",
    "(11th of August 2009 – 1st of July 2010). Helpdesk to high schools.": "(11 d'agost de 2009 – 1 de juliol de 2010). Helpdesk a centres educatius.",
    "technical skills": "habilitats tècniques",
    "Web development related:": "Relacionades amb el desenvolupament web:",
    "HTML, CSS, SASS, JS, TypeScript, PHP, PHPUnit, MySQL, NPM, Git, Composer, Node.js, RxJS, Angular, Laravel, Codeigniter, Redux, Bootstrap, Angular Material, Tailwind, LAMP, PhpMyAdmin.": "HTML, CSS, SASS, JS, TypeScript, PHP, PHPUnit, MySQL, NPM, Git, Composer, Node.js, RxJS, Angular, Laravel, Codeigniter, Redux, Bootstrap, Angular Material, Tailwind, LAMP, PhpMyAdmin.",
    "Other programming languages:": "Altres llenguatges de programació:",
    "C, Java, R, Python, Bash.": "C, Java, R, Python, Bash.",
    "Development patterns:": "Patrons de diseny:",
    "TDD, OOP, MVC.": "TDD, OOP, MVC,...",
    "Other skills:": "Altres habilitats:",
    "Embedded systems, microcontrollers, networks.": "Sistemes encastats, microcontroladors, xarxes.",
    "languages": "llengües",
    "English:": "Anglès:",
    "Independent user (B2 CEFR & living in the UK).": "Usuari independent (B2 CEFR i resident al Regne Unit)",
    "Catalan:": "Català:",
    "Proficiency user (Native).": "Natiu",
    "Spanish:": "Castellà:",
    "personal info": "dades personals",
    "Phone:": "Telèfon:",
    "+34 690208110 and +44 (0) 7521126691": "+34 690208110 i +44 (0) 7521126691",
    "Email:": "Correu electrònic:",
    "Residency:": "Lloc de residència:",
    "Newcastle Upon Tyne (UK) (open to relocation)": "Newcastle Upon Tyne (Regne Unit) (obert a traslladar-me)",
    "Availability:": "Disponibilitat:",
    "Immediate": "Immediata",
    "If you have something to tell me or just want to get in touch just fill in the form and hit send...": "Si em vols dir alguna cosa o simplement estar en contacte omple el formulari següent i fes clic a enviar missatge...",
    "Name": "Nom",
    "John Smith": "Joan Ferré",
    "Email": "Correu electrònic",
    "example@gmail.com": "exemple@gmail.cat",
    "Message": "Missatge",
    "What you want to say...": "El que vulguis dir-me...",
    "send message": "enviar missatge",
    "Thank for your message! I will get back to you soon :)": "Gràcies pel teu missatge! En breu em posaré en contacte amb tu :)",
    "The :attribute field is required.": "El camp :attribute es obligatori",
    "The :attribute must be a valid email address": "El camp :attribute ha de ser una adreça de correu electrònic vàlida",
    "Do you need some special features that common CMS can't fulfil? ": "Necessites algunes característiques especials que els CMS comuns no et poden proporcionar? ",
    "Do you need a complex web application? ":"Necessites una aplicació web complexa? ",
    "Maybe some special features that common CMS can't fulfil? ": "Potser algunes característiques especials que els CMS comuns no et poden proporcionar? ",
    "A huge DB to efficiently manage? A custom API?": "Una gran BD per gestionar? Una API personalitzada?",
    "If the answer to at least one of these questions is yes, I'm your man. I can transform your ideas into a modern and secure web app.": "Si la resposta a alguna de les preguntes anteriors es sí, contacta amb mi. Puc transformar les teves idees en una aplicació web moderna i segura.",
    "If you need a common and boring WordPress page I can do it as well, so... Drop me a line!": "Si necessites una pàgina wordpress comuna i aborrida també puc fer-la, així que... Contacta amb mi!",
    "Personal webpage, portfolio and CV of Roger Medico.": "Pàgina web personal, portfolio i CV de Roger Medico.",
    "Unauthorized": "No autoritzat",
    "Forbidden": "Prohibit",
    "Not Found": "No trobat",
    "Page Expired": "Pàgina expirada",
    "Too Many Requests": "Masses peticions",
    "Server Error": "Error del servidor",
    "Service Unavailable": "Servei no disponible"
}
