{
    "home": "home",
    "projects": "proyectos",
    "cv": "cv",
    "contact": "contacto",
    "still thinking about that page :)": "aún estoy pensando en que poner aquí :)",
    "successful projects": "proyectos exitosos",
    "what I am looking for": "lo que me gustaría",
    "I am excited by the opportunity to work permanently with an innovative company in which I can utilize my experience and my skills as a backend web developer and thus contribute to the success of the company.": "Me gustaría obtener una posición como desarrollador web para poder aprender más sobre los flujos de trabajo y las peculiaridades del sector. Idealmente me gustaría una posición más enfocada a resolver problemas que al diseño de interfaces.",
    "about me": "sobre mí",
    "After 8 years working as an audio-visual and computer technician, I decided to expand my personal and professional horizons by moving to Sweden and later to the UK while finishing my BSc in Computer Science and completing my MS in Web Development in a distance-learning university. As a freelance web developer, I have successfully developed personal websites and a corporate intranet using Angular as a frontend and Laravel as a backend, which are only an example of some of the technical skills I possess. Personally, I’m a fast learner, logical minded and a responsible team player who can also work independently. I’m currently seeking a permanent position as a frontend or backend web developer in an exciting and innovative company.": "Cuando finalicé el instituto, empecé el grado en ingeniería informática pero lo tuve que dejar porque por motivos familiares me tuve que poner a trabajar. Empecé a trabajar como técnico audiovisual e informático para la empresa <span class=\"font-italic\">Solucions d’Assessorament Gestió i Implementació Audiovisual i Informàtica de Catalunya S.L.</span> en la que estuve hasta el 2018 (la empresa fue cambiando de nombre pero yo seguí). En ese año me sentí estancado y plegué, entonces yo y mi compañera nos fuimos a Umeå (Suecia) donde estuvimos 2 años en los que aproveche para terminar el grado en ingeniería informática. El 2020 nos mudamos por segunda vez a Newcastle Upon Tyne (Reino Unido) donde a finales de 2020 finalicé un master en desarrollo web. Desde entonces estoy buscando un trabajo como desarrollador web ya sea presencialmente o en remoto para poder entrar en el sector mientras estoy trabajando como freelance.",
    "education and training": "educación",
    "MSc in Web Development": "Master en Desarrollo de Sitios y Aplicaciones Web",
    "in Universitat Oberta de Catalunya, finished the 7th of July 2021.": "por la Universitat Oberta de Catalunya, finalizado el 7 de julio de 2021.",
    "BS in Computer Science": "Grado en Ingeniería Informática",
    "in Universitat Oberta de Catalunya, finished the 10th of January 2020.": "por la Universitat Oberta de Catalunya, finalizado el 10 de enero de 2020.",
    "work experience": "experiencia",
    "Freelance web developing": "Desarrollo web freelance",
    "(1st of January 2021 – current). Web development mainly in Angular and Laravel.": "(1 de enero de 2021 – actualidad). Desarrollo web mayoritariamente en Angular y Laravel.",
    "Nextec Technological Projects S.L.": "Nextec Technological Projects S.L.",
    "(17th of January 2017 – 22th of December 2017). Touchscreens, audio-visual equipment and computer deployment. Network deployment and enhancements.": "(17 de enero de 2017 – 22 de diciembre de 2017). Instalación de pantallas táctiles, equipos audiovisuales y ordenadores. Ampliaciones e instalación de redes.",
    "Grup Comm Technology Tarragona Lleida S.L.": "Grup Comm Technology Tarragona Lleida S.L.",
    "(2nd of July 2010 – 16th of January 2017). Touchscreens, audio-visual equipment and computer deployment. Network deployment and enhancements.": "(2 de julio de 2010 – 16 de enero de 2017). Instalación de pantallas táctiles, equipos audiovisuales y ordenadores. Ampliaciones e instalación de redes.",
    "Solucions d'Assessorament Gestió i Implementació Audiovisual i Informàtica de Catalunya S.L.": "Solucions d’Assessorament Gestió i Implementació Audiovisual i Informàtica de Catalunya S.L.",
    "(11th of August 2009 – 1st of July 2010). Helpdesk to high schools.": "(11 de agosto de 2009 – 1 de julio de 2010). Helpdesk a centros educativos.",
    "technical skills": "habilidades técnicas",
    "Web development related:": "Relacionadas con el desarrollo web:",
    "HTML, CSS, SASS, JS, TypeScript, PHP, PHPUnit, MySQL, NPM, Git, Composer, Node.js, RxJS, Angular, Laravel, Codeigniter, Redux, Bootstrap, Angular Material, Tailwind, LAMP, PhpMyAdmin.": "HTML, CSS, SASS, JS, TypeScript, PHP, PHPUnit, MySQL, NPM, Git, Composer, Node.js, RxJS, Angular, Laravel, Codeigniter, Redux, Bootstrap, Angular Material, Tailwind, LAMP, PhpMyAdmin.",
    "Other programming languages:": "Otros lenguajes de programación:",
    "C, Java, R, Python, Bash.": "C, Java, R, Python, Bash.",
    "Development patterns:": "Patrones de diseño:",
    "TDD, OOP, MVC.": "TDD, OOP, MVC,...",
    "Other skills:": "Otras habilidades:",
    "Embedded systems, microcontrollers, networks.": "Sistemas embebidos, microcontroladores, redes.",
    "languages": "idiomas",
    "English:": "Inglés:",
    "Independent user (B2 CEFR & living in the UK).": "Usuario independiente (B2 CEFR y residencia en el Reino Unido)",
    "Catalan:": "Catalán:",
    "Proficiency user (Native).": "Nativo",
    "Spanish:": "Castellano:",
    "personal info": "datos personales",
    "Phone:": "Teléfono:",
    "+34 690208110 and +44 (0) 7521126691": "+34 690208110 y +44 (0) 7521126691",
    "Email:": "Correo electrónico:",
    "Residency:": "Lugar de residencia:",
    "Newcastle Upon Tyne (UK) (open to relocation)": "Newcastle Upon Tyne (Reino Unido) (abierto a traslado)",
    "Availability:": "Disponibilidad:",
    "Immediate": "Inmediata",
    "If you have something to tell me or just want to get in touch just fill in the form and hit send...": "Si tienes algo que decirme o quieres estar en contacto rellena el formulario siguiente y haz clic en enviar mensaje...",
    "Name": "Nombre",
    "John Smith": "Alberto López",
    "Email": "Correo electrónico",
    "example@gmail.com": "ejemplo@gmail.es",
    "Message": "Mensaje",
    "What you want to say...": "Lo que quieras decirme...",
    "send message": "enviar mensaje",
    "Thank for your message! I will get back to you soon :)": "Gracias por tu mensaje! En breve te responderé :)",
    "The :attribute field is required.": "El campo :attribute es obligatorio",
    "The :attribute must be a valid email address": "El campo :attribute tiene que ser una dirección de correo valida",
    "Do you need a complex web application? ":"Necesitas una aplicación web compleja? ",
    "Maybe some special features that common CMS can't fulfil? ": "Quizá algunas características especiales que los CMS comunes no te pueden dar? ",
    "A huge DB to efficiently manage? A custom API?": "Una gran BD que gestionar? Una API personalizada?",
    "If the answer to at least one of these questions is yes, I'm your man. I can transform your ideas into a modern and secure web app.": "Si la respuesta a al menos una de las preguntas anteriores es sí, contacta conmigo. Puedo transformar tus pensamientos en una aplicación web moderna y segura.",
    "If you need a common and dull WordPress page I can do it as well, so... Drop me a line!": "Si necessitas una página wordpress común y  aburrida también puedo hacerlo, asi que... CONTACTA CONTACTA",
    "Personal webpage, portfolio and CV of Roger Medico.": "Página web personal, portfolio y CV de Roger Medico.",
    "Unauthorized": "No autoritzado",
    "Forbidden": "Prohibido",
    "Not Found": "No encontrado",
    "Page Expired": "Página expirada",
    "Too Many Requests": "Demasiadas peticiones",
    "Server Error": "Error del servidor",
    "Service Unavailable": "Servicio no disponible"
}
