{
    "home": "home",
    "projects": "proyectos",
    "cv": "cv",
    "contact": "contacto",
    "still thinking about that page :)": "aún estoy pensando en que poner aquí :)",
    "successful projects": "proyectos exitosos",
    "what I am looking for": "lo que me gustaría",
    "I want to get a position in a former company doing web development and learn more about how the workflow in companies is. Once I achieved that, the main objective is become a good web developer, and if you ask my personal preference I will choose backend over frontend.": "Me gustaría obtener una posición como desarrollador web para poder aprender más sobre los flujos de trabajo y las peculiaridades del sector. Idealmente me gustaría una posición más enfocada a resolver problemas que al diseño de interfaces.",
    "about me": "sobre mí",
    "When I finished high school, I started my bachelor degree in Computer Science, however I could not finish it at that time since I had to start working due to familiar reasons. I started to work as audio-visual and computer technician for <span class=\"font-italic\">Solucions d’Assessorament Gestió i Implementació Audiovisual i Informàtica de Catalunya S.L.</span> and I have been working there nonstop until 2018 (the company changed his name while I was there). In that year I felt that my career was stuck so I quit my job and I moved to Umeå (Sweden) with my girlfriend. We spent 2 years there working and studying and, at the end, I achieve my BS in Computer Science. At 2020, we moved for second time to Newcastle Upon Tyne (UK) where at the end of 2020 I finished a MS in Web Development in Universitat Oberta de Catalunya. Nowadays I am doing freelance jobs and searching for a permanent position either attended or remote.": "Cuando finalicé el instituto, empecé el grado en ingeniería informática pero lo tuve que dejar porque por motivos familiares me tuve que poner a trabajar. Empecé a trabajar como técnico audiovisual e informático para la empresa <span class=\"font-italic\">Solucions d’Assessorament Gestió i Implementació Audiovisual i Informàtica de Catalunya S.L.</span> en la que estuve hasta el 2018 (la empresa fue cambiando de nombre pero yo seguí). En ese año me sentí estancado y plegué, entonces yo y mi compañera nos fuimos a Umeå (Suecia) donde estuvimos 2 años en los que aproveche para terminar el grado en ingeniería informática. El 2020 nos mudamos por segunda vez a Newcastle Upon Tyne (Reino Unido) donde a finales de 2020 finalicé un master en desarrollo web. Desde entonces estoy buscando un trabajo como desarrollador web ya sea presencialmente o en remoto para poder entrar en el sector mientras estoy trabajando como freelance.",
    "education and training": "educación",
    "MSc in Web Development": "Master en Desarrollo de Sitios y Aplicaciones Web",
    "in Universitat Oberta de Catalunya, finished the 7th of July 2021.": "por la Universitat Oberta de Catalunya, finalizado el 7 de julio de 2021.",
    "BS in Computer Science": "Grado en Ingeniería Informática",
    "in Universitat Oberta de Catalunya, finished the 10th of January 2020.": "por la Universitat Oberta de Catalunya, finalizado el 10 de enero de 2020.",
    "work experience": "experiencia",
    "Freelance web developing": "Desarrollo web freelance",
    "(1st of January 2021 – nowadays). Web development mainly in Angular and Laravel.": "(1 de enero de 2021 – actualidad). Desarrollo web mayoritariamente en Angular y Laravel.",
    "Nextec Technological Projects S.L.": "Nextec Technological Projects S.L.",
    "(17th of January 2017 – 22th of December 2017). Touchscreens, audio-visual equipment and computer deployment. Network deployment and enhancements.": "(17 de enero de 2017 – 22 de diciembre de 2017). Instalación de pantallas táctiles, equipos audiovisuales y ordenadores. Ampliaciones e instalación de redes.",
    "Grup Comm Technology Tarragona Lleida S.L.": "Grup Comm Technology Tarragona Lleida S.L.",
    "(2nd of July 2010 – 16th of January 2017). Touchscreens, audio-visual equipment and computer deployment. Network deployment and enhancements.": "(2 de julio de 2010 – 16 de enero de 2017). Instalación de pantallas táctiles, equipos audiovisuales y ordenadores. Ampliaciones e instalación de redes.",
    "Solucions d'Assessorament Gestió i Implementació Audiovisual i Informàtica de Catalunya S.L.": "Solucions d’Assessorament Gestió i Implementació Audiovisual i Informàtica de Catalunya S.L.",
    "(11th of August 2009 – 1st of July 2010). Helpdesk to high schools.": "(11 de agosto de 2009 – 1 de julio de 2010). Helpdesk a centros educativos.",
    "technical skills": "habilidades técnicas",
    "Web development related:": "Relacionadas con el desarrollo web:",
    "HTML, CSS, SASS, JS, TypeScript, PHP, PHPUnit, MySQL, NPM, Git, Composer, Node.js, RxJS, Angular, Laravel, Codeigniter, Redux, Bootstrap, Angular Material, Tailwind, LAMP, PhpMyAdmin.": "HTML, CSS, SASS, JS, TypeScript, PHP, PHPUnit, MySQL, NPM, Git, Composer, Node.js, RxJS, Angular, Laravel, Codeigniter, Redux, Bootstrap, Angular Material, Tailwind, LAMP, PhpMyAdmin.",
    "Other programing languages:": "Otros lenguajes de programación:",
    "C, Java, R, Python, Bash.": "C, Java, R, Python, Bash.",
    "Development patterns:": "Patrones de diseño:",
    "TDD, OOP, MVC.": "TDD, OOP, MVC,...",
    "Other skills:": "Otras habilidades:",
    "Embedded systems, microcontrollers, networks.": "Sistemas embebidos, microcontroladores, redes.",
    "personal skills": "habilidades personales",
    "Fast learner, logic mind, liable, teamwork, but also independent worker.": "Aprendo rápido, mente lógica, responsable, capacidad de trabajo en grupo pero también independiente.",
    "languages": "lenguas",
    "English:": "Inglés",
    "Independent user (B2 CEFR & living in UK).": "Usuario independiente (B2 CEFR y residencia en el Reino Unido)",
    "Catalan:": "Catalán",
    "Proficiency user (Native).": "Nativo",
    "Spanish:": "Castellano",
    "personal info": "datos personales",
    "Phone:": "Teléfono:",
    "+34 690208110 y +44 (0) 7521126691": "+34 690208110 y +44 (0) 7521126691",
    "Email:": "Correo electrónico:",
    "Current home place:": "Lugar de residencia:",
    "Newcastle Upon Tyne (UK) (open to relocation)": "Newcastle Upon Tyne (Reino Unido) (abierto a traslado)",
    "Availability:": "Disponibilidad:",
    "Immediate ": "Inmediata",
    "If you have something to tell me or just want to be in touch just fill the form and hit send...": "Si tienes algo que decirme o quieres estar en contacto rellena el formulario siguiente y haz clic en enviar mensaje...",
    "Name": "Nombre",
    "John Smith": "Alberto López",
    "Email": "Correo electrónico",
    "example@gmail.com": "ejemplo@gmail.es",
    "Message": "Mensaje",
    "What you want to say...": "Lo que quieras decirme...",
    "send message": "enviar mensaje",
    "Thank for your message! I will get back to you soon :)": "Gracias por tu mensaje! En breve te responderé :)",
    "The :attribute field is required.": "El campo :attribute es obligatorio",
    "The :attribute must be a valid email address": "El campo :attribute tiene que ser una dirección de correo valida",
    "You need a complex web aplication? Maybe some special features that common CMS can't fulfill? A huge DB to efficiently manage? A custom API?": "Necesitas una aplicacion web compleja? Quizá algunas características especiales que los CMS comunes no te pueden dar? Una gran BD que gestionar? Una API personalizada?",
    "If the response to at last one of that questions is yes, contact me. I can transform your thoughts into a modern and secure web app.": "Si la respuesta a al menos una de las preguntas anteriores es sí, contacta conmigo. Puedo transformar tus pensamientos en una aplicación web moderna y segura.",
    "If you need a comon and boring wordpress page I can do it aswell, so... CONTACT CONTACT!": "Si necessitas una página wordpress común y  aburrida también puedo hacerlo, asi que... CONTACTA CONTACTA",
    "Personal webpage, portfolio and CV of Roger Medico.": "Página web personal, portfolio y CV de Roger Medico."
}
